#include <iostream>

using namespace std;

int main()
{
	// 算术运算符：对数字类型（整形、浮点型、字符型）的数据进行运算
	// +    ：加法运算
	// -    ：减法运算
	// *    ：乘法运算
	// /    ：除法运算
	// %    ：模运算（求余数）
	//
	// 注意事项：整形与整形的计算结果还是整形。如果出现了浮点的计算结果，会自动将浮点的结果类型转换成整形
	//
	cout << "10+3=" << 10 + 3 << endl;
	cout << "10-3=" << 10 - 3 << endl;
	cout << "10*3=" << 10 * 3 << endl;
	cout << "10/3=" << 10 / 3 << endl;
	cout << "10%3=" << 10 % 3 << endl;

	// ++    :自增运算符，表示对这个变量的值在现有的基础上+1
	// --    :自减运算符，表示对这个变量的值在现有的基础上-1
	// 注意事项：自增自减运算符可以放在变量前或变量后
	// 放在变量前：代表先对变量进行自增自减的操作，然后取自增自减之后的值来使用
	// 放在变量后：代表先取变量值使用，然后再进行自增自减的操作

	int n1 = 10;
	--n1;
	cout << n1 << endl;
	cout << ++n1 << endl;
	cout << n1 << endl;
	cout << n1++ << endl;
	cout << n1 << endl;
	cout << --n1 << endl;
	cout << n1 << endl;
	cout << n1-- << endl;
	cout << n1 << endl;
}